SITE_MAP = {
    1000: '好博体育', 2000: '黄金体育', 3000: '宾利体育', 4000: 'HOME体育',
    5000: '亚洲之星', 6000: '玖博体育', 7000: '蓝火体育', 8000: 'A7体育',
    9000: '皇马体育', 9001: '摩根体育', 9002: '友博体育', 9003: '跃动体育',
    9004: '港岛娱乐城', 9005: '新完美体育', 9010: '百羿娱乐', 9011: '云霄体育',
    9012: '欧博体育', 9013: '顶盛体育', 9014: '酷游国际', 9015: 'KS娱乐',
    9016: '九鼎娱乐', 9017: '胜发体育', 9018: '汇丰娱乐', 9019: '天下会',
    9020: '英博体育', 9021: '红果体育', 9022: '汇旺娱乐城', 9023: '051娱乐',
    9024: '东方木娱乐', 9025: '燚盛娱乐', 9026: '极光体育', 9027: '米哈娱乐',
    9028: '新博娱乐', 9029: '太阳城', 9030: '新宝博体育', 9031: '澳博体育',
    9032: 'bet365亚洲', 9033: '永利娱乐', 9034: 'UB.BET', 9035: 'KG体育',
    9036: '欧贝体育', 9037: '博盈体育', 9038: '红牌体育', 9039: '虎扑体育',
    9040: '博盈国际会', 9041: '寰亚体育', 9042: '智博体育', 9043: '2212体育',
}

VENUE_MAP = {
    # 体育
    "CRTY": "皇冠体育", "IMTY": "IM体育", "SBTY": "沙巴体育", "FBTY": "FB体育",
    "XMTY": "熊猫体育", "WMXMTY": "熊猫体育", "BBTY": "BB体育",
    # 电竞
    "LHDJ": "雷火电竞", "IMDJ": "电竞牛", "DBDJ": "多宝电竞", "WMDBDJ": "多宝电竞",
    # 真人
    "CQ9ZR": "MT真人", "YXZR": "亚星真人", "EVOZR": "EVO真人", "PPZR": "PP真人",
    "BBINZR": "BBIN真人", "BGZR": "BG真人", "WMZR": "完美真人", "AGZR": "PA真人",
    "DBZR": "多宝真人", "WLZR": "瓦力真人", "KXZR": "皇马真人", "WMDBZR": "多宝真人",
    "DPZR": "德扑真人", "OBZR": "欧博真人", "EEAIZR": "EEAI真人",
    # 棋牌
    "BYQP": "博雅棋牌", "GFQP": "GFG棋牌", "DBQP": "多宝棋牌", "IMQP": "IM棋牌",
    "WLQP": "瓦力棋牌", "WMDBQP": "多宝棋牌", "WMBYQP": "博雅棋牌", "KYQP": "开元棋牌",
    "LEGQP": "乐游棋牌", "QQQP": "QQ德扑",
    # 电子
    "CQ9DZ": "CQ9电子", "PTDZ": "PT电子", "EGDZ": "EG电子", "DBHX": "多宝哈希",
    "AGDZ": "PA电子", "DBDZ": "多宝电子", "GFDZ": "GFG电子", "PPDZ": "PP电子",
    "PGDZ": "PG电子", "WLDZ": "瓦力电子", "JDBDZ": "JDB电子", "KYDZ": "KY电子",
    "FGDZ": "5G电子", "WMDBDZ": "多宝电子",
    # 彩票
    "SGCP": "双赢彩票", "TCGCP": "TCG彩票", "DBGGL": "DB刮刮乐", "G1CP": "G1彩票",
    "DBCP": "多宝彩票", "WMDBCP": "多宝彩票", "GFCP": "GFG彩票",
    # 捕鱼
    "AGBY": "PA捕鱼", "DBBY": "多宝捕鱼", "BYBY": "博雅捕鱼", "CQ9BY": "MT弹珠",
    "HBBY": "好博弹珠", "WMDBBY": "多宝捕鱼", "APABY": "APA柏青哥", "CR7BY": "CR7柏青哥"
}